Revit 2026 API

# SteelElementsFailures Properties

---

The BuiltInFailuresSteelElementsFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SteelElementInvisibleInCurrentLevelOfDetailWarn | The created elements are only visible in Detail Level: Fine. |
|  | SteelElementModifiersWillBeIgnoredWarn | The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry. |

#### Reference

BuiltInFailuresSteelElementsFailures Class

Autodesk.Revit.DB Namespace